<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Intro-to-the-dataframe" data-toc-modified-id="Intro-to-the-dataframe-1">Intro to the dataframe</a></span></li><li><span><a href="#Importing-pandas" data-toc-modified-id="Importing-pandas-2">Importing pandas</a></span></li><li><span><a href="#Reading-in-data" data-toc-modified-id="Reading-in-data-3">Reading in data</a></span><ul class="toc-item"><li><span><a href="#The-read_csv-function" data-toc-modified-id="The-read_csv-function-3.1">The read_csv function</a></span></li><li><span><a href="#Some-important-options-for-the-read_csv()-function" data-toc-modified-id="Some-important-options-for-the-read_csv()-function-3.2">Some important options for the <code>read_csv()</code> function</a></span></li></ul></li><li><span><a href="#Important-notice:-reading-in-files-from-your-computer" data-toc-modified-id="Important-notice:-reading-in-files-from-your-computer-4">Important notice: reading in files from your computer</a></span></li><li><span><a href="#Exploring-the-data" data-toc-modified-id="Exploring-the-data-5">Exploring the data</a></span><ul class="toc-item"><li><span><a href="#Exploring-the-data-in-the-spyder-variable-explorer" data-toc-modified-id="Exploring-the-data-in-the-spyder-variable-explorer-5.1">Exploring the data in the spyder variable explorer</a></span></li><li><span><a href="#Exploring-the-data-using-code" data-toc-modified-id="Exploring-the-data-using-code-5.2">Exploring the data using code</a></span></li></ul></li><li><span><a href="#Columns-and-indices" data-toc-modified-id="Columns-and-indices-6">Columns and indices</a></span></li><li><span><a href="#Accessing-the-columns" data-toc-modified-id="Accessing-the-columns-7">Accessing the columns</a></span></li><li><span><a href="#Creating-new-variables-(columns)" data-toc-modified-id="Creating-new-variables-(columns)-8">Creating new variables (columns)</a></span></li><li><span><a href="#read_csv()-options:-summary" data-toc-modified-id="read_csv()-options:-summary-9"><code>read_csv()</code> options: summary</a></span><ul class="toc-item"><li><span><a href="#Separator" data-toc-modified-id="Separator-9.1">Separator</a></span></li><li><span><a href="#Absence-of-a-header" data-toc-modified-id="Absence-of-a-header-9.2">Absence of a header</a></span></li><li><span><a href="#Specifying-missing-value" data-toc-modified-id="Specifying-missing-value-9.3">Specifying missing value</a></span></li><li><span><a href="#Reading-in-an-existing-index-column" data-toc-modified-id="Reading-in-an-existing-index-column-9.4">Reading in an existing index column</a></span></li></ul></li><li><span><a href="#Exercises" data-toc-modified-id="Exercises-10">Exercises</a></span><ul class="toc-item"><li><span><a href="#Exercise-1" data-toc-modified-id="Exercise-1-10.1">Exercise 1</a></span></li><li><span><a href="#Exercise-2" data-toc-modified-id="Exercise-2-10.2">Exercise 2</a></span></li><li><span><a href="#Exercise-3" data-toc-modified-id="Exercise-3-10.3">Exercise 3</a></span></li><li><span><a href="#Exercise-4" data-toc-modified-id="Exercise-4-10.4">Exercise 4</a></span></li></ul></li></ul></div>

# Pandas: introduction

## Intro to the dataframe

See slides for an introduction to the dataframe.

## Importing pandas

pandas is part of the anaconda python distribution and can be directly imported.

In [26]:
import pandas



## Reading in data

###  The read_csv function

The most common scenario is to read in a data file from disk. Pandas has powerful functions to read in data. For example, the ```read_csv()```function has many (and I mean many) options:

```read_csv(filepath_or_buffer, sep=', ', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal='.', lineterminator=None, quotechar='"', quoting=0, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=False, error_bad_lines=True, warn_bad_lines=True, skipfooter=0, skip_footer=0, doublequote=True, delim_whitespace=False, as_recarray=False, compact_ints=False, use_unsigned=False, low_memory=True, buffer_lines=None, memory_map=False, float_precision=None)```

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html

Luckily, we wont be needing most of the options most of the time.

Here, I will use example data on the survivorship on the Titanic. The data is described here: https://vincentarelbundock.github.io/Rdatasets/doc/datasets/Titanic.html

You can also use this link: https://tinyurl.com/y894ft6g

In [27]:
# options used: read in column 0 as the index, 'NA' is read as missing values.
data = pandas.read_csv('https://tinyurl.com/y894ft6g',index_col=0,na_values='NA')
data.head()

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

### Some important options for the ```read_csv()``` function

Some options will come in handy. These include the ```separator``` option and the ```header``` option. Often, data files use different seperators or do not come with a header (i.e., a row of column names). If so, these options allow reading in the file correctly. The default values for these options are:

+ separator: ```sep=', '```
+ header:  ```header='infer'```

In [28]:
import pandas
silly_data = pandas.read_csv('data/silly.txt')
silly_data

    123*234*123*1234
0  4543*2342*123*224
1  456*1223*1234*123

In [29]:
silly_data = pandas.read_csv('data/silly.txt', sep='*')
silly_data

    123   234  123.1  1234
0  4543  2342    123   224
1   456  1223   1234   123

In [30]:
silly_data = pandas.read_csv('data/silly.txt', sep='*', header=None)
silly_data

      0     1     2     3
0   123   234   123  1234
1  4543  2342   123   224
2   456  1223  1234   123

If the data does not contain a header, you can set the column names to more convient values as follows,

In [31]:
silly_data.columns = ['some_name', 'column2', 'age', 'test']
silly_data

   some_name  column2   age  test
0        123      234   123  1234
1       4543     2342   123   224
2        456     1223  1234   123

## Important notice: reading in files from your computer

The ```read_csv()``` can only find the data file if the data file are in the same folder.

![title](Selection_318.png)

If you do not place the python script and the data file in the same folder, you need to provide the (relative) path to the file.

## Exploring the data

### Exploring the data in the spyder variable explorer

[Demo goes here]

### Exploring the data using code

Print the top rows of the dataset

In [32]:
print(data.head(3))

                                  Name PClass   Age     Sex  Survived  SexCode
1         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2          Allison, Miss Helen Loraine    1st   2.0  female         0        1
3  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

How big is our dataset?

In [33]:
print(data.shape)

(1313, 6)

Remember, the dataframe allows for multiple data types.

In [34]:
print(data.dtypes)

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
SexCode       int64
dtype: object

## Columns and indices

In [35]:
a = data.columns
print(a)

Index(['Name', 'PClass', 'Age', 'Sex', 'Survived', 'SexCode'], dtype='object')

In [36]:
b = data.index
print(b)

Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
            ...
            1304, 1305, 1306, 1307, 1308, 1309, 1310, 1311, 1312, 1313],
           dtype='int64', length=1313)

## Accessing the columns

In [37]:
sex = data.SexCode
#print(sex)

sex = data['SexCode']
print(sex)

sex.mean()

1       1
2       1
3       0
4       1
5       0
       ..
1309    0
1310    0
1311    0
1312    0
1313    0
Name: SexCode, Length: 1313, dtype: int64

0.3518659558263519

In [38]:
name = data.Age
print(name.head())

1    29.00
2     2.00
3    30.00
4    25.00
5     0.92
Name: Age, dtype: float64

## Creating new variables (columns)

You can make new variables (columns) based on existing variables. And add the new columns to the dataframe.

In [39]:
data['Months'] = data['Age'] * 12
data.head()

,Name,PClass,Age,Sex,Survived,SexCode,Months
1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,348.00
2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,24.00
3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,360.00
4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,300.00
5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,11.04

In [40]:
data['Kids'] = data['Months'] < 15
data.head()

,Name,PClass,Age,Sex,Survived,SexCode,Months,Kids
1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,348.00,False
2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,24.00,False
3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,360.00,False
4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,300.00,False
5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,11.04,True

In [41]:
data['Silly'] = data['Months'] / data['Age']
data.head()

,Name,PClass,Age,Sex,Survived,SexCode,Months,Kids,Silly
1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,348.00,False,12.0
2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,24.00,False,12.0
3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,360.00,False,12.0
4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,300.00,False,12.0
5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,11.04,True,12.0

In [42]:
data['Child'] =  data.Age < 18
data.head()

,Name,PClass,Age,Sex,Survived,SexCode,Months,Kids,Silly,Child
1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1,348.00,False,12.0,False
2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1,24.00,False,12.0,True
3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0,360.00,False,12.0,False
4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1,300.00,False,12.0,False
5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0,11.04,True,12.0,True

## `read_csv()` options: summary

### Separator 

`sep` specifies the column separator in your datafile:
+ Example 1: for files separated by commas: `sep = ','`
+ Example 2: For files separated by tabs: `sep = '\t'`
+ Example 3: For files separated by spaces: `sep = ' '`

In [43]:
# Reading in a file separated by spaces
# WARNING:
# This example ignores the fact that this file uses * to indicate missing values
car_data = pandas.read_csv('data/cars.txt', sep = ' ')
car_data.head()

,make,model,type,min_price,mid_price,max_price,mpg_city,mpg_hgw,airbag,drive,...,tank,passengers,length,wheelbase,width,uturn,rearseat,luggage,weight,domestic
0,Acura,Integra,Small,12.9,15.9,18.8,25,31,0,1,...,13.2,5,177,102,68,37,26.5,11,2705,0
1,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,2,1,...,18.0,5,195,115,71,38,30.0,15,3560,0
2,Audi,90,Compact,25.9,29.1,32.3,20,26,1,1,...,16.9,5,180,102,67,37,28.0,14,3375,0
3,Audi,100,Midsize,30.8,37.7,44.6,19,26,2,1,...,21.1,6,193,106,70,37,31.0,17,3405,0
4,BMW,535i,Midsize,23.7,30.0,36.2,22,30,1,0,...,21.1,4,186,109,69,39,27.0,13,3640,0

### Absence of a header

Setting `header = None` tells pandas the data file has no header

In [44]:
# Reading in a file without a header
silly_data = pandas.read_csv('data/silly.txt', sep='*', header=None)
# You can then set the column names manually
silly_data.columns = ['variable1', 'some_variable_name', 'test', 'some_other_name']
silly_data.head()

   variable1  some_variable_name  test  some_other_name
0        123                 234   123             1234
1       4543                2342   123              224
2        456                1223  1234              123

### Specifying missing value

Using the `na_values` argument, you can tell pandas what values to consider as missing values.

In [45]:
# This file uses * to indicate missing values
car_data = pandas.read_csv('data/cars.txt', sep = ' ', na_values='*')

### Reading in an existing index column

Some files have a column that can serve as an index (a name for each row). You can tell pandas to re-use this existing column instead of making its own new index.

In [46]:
# This data file has a column (the first one) that can serve as an index. 
# Here, we tell pandas to read that column in and re-use it as an index.
# If we don't specify this, the column will be read in as a normal variable
# and pandas will create its own index.
data = pandas.read_csv('https://tinyurl.com/y894ft6g',index_col=0,na_values='NA')

## Exercises

### Exercise 1

+ Read in the cars.txt file (download it or read it in from tinyurl.com/ybbw5gwg)
+ Print the first lines of the data
+ Print the column names
+ Calculate the difference in mpg on the highway and the city, add this difference as a new variable to the data frame.


### Exercise 2


Download the `wages1833.csv` data file (from the data folder) and save it to your computer. You can also use this direct url: http://tinyurl.com/y6orr2bg

This file contains data on the wages of Lancashire cotton factory workers in 1833.  For each age category, the file lists the following:

* `age`: age in years
* `mnum:` number of male workers of the corresponding age
* `mwage`: average wage of male workers of the corresponding age
* `fnum`: number of female workers of the corresponding age
* `fwage`: average wage of female workers of the corresponding age

More info on the data can be found in this paper:  Boot, H.M. 1995. How Skilled Were the Lancashire Cotton Factory Workers in 1833? Economic History Review 48: 283-303.

Write a script that does the following:

* Read in the data as a pandas dataframe
* Adds a new variable that lists the difference between the number of male and female workers
* Adds a new variable ```diff_pct``` that gives the difference in average wage between the male and female workers expressed as a percentage of the female wage. For example, if the average female wage is 90 and the male wage is 135, this new column lists the number 50. In the form of an equation, this gives:

$$
diff_{pct} = 100 \times \frac{(mwage - fwage)}{fwage}
$$



### Exercise 3


Suppose, I want to read in a file named `data.txt`. The columns of the data are separated by tabs. How can I make sure that pandas reads this data correctly? Complete the blank in the following piece of code:

```python
data = pandas.read_csv('data.txt', _______)
```


### Exercise 4

Suppose, my data file named `data.csv` has no header (no variable names). How can I read in this file correctly?